https://towardsdatascience.com/advanced-tips-on-how-to-read-csv-files-into-pandas-84ebb170f6e5

Another article:

https://www.listendata.com/2019/06/pandas-read-csv.html

How to import different file types:

https://www.listendata.com/2017/02/import-data-in-python.html

Speeding up the csv import process:

https://towardsdatascience.com/all-the-pandas-read-csv-you-should-know-to-speed-up-your-data-analysis-1e16fe1039f3

Encoding detection:

https://www.kaggle.com/code/alexisbcook/character-encodings/tutorial

In [1]:
import pandas as pd
import numpy as np

## Read csv files into Pandas the regular way:

In [2]:
employees = pd.read_csv("employees.csv")

In [3]:
employees.sample(10)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
662,Katherine,Female,12/19/2000,1:40 AM,41643,4.659,True,Distribution
707,Patricia,Female,3/7/1998,1:10 AM,75825,7.839,False,Engineering
652,Willie,Male,12/5/2009,5:39 AM,141932,1.017,True,Engineering
315,Bobby,NaN,9/1/1995,2:09 PM,108127,15.858,False,Client Services
167,Christopher,Male,12/24/2011,12:22 PM,142178,17.984,True,Sales
546,Joseph,Male,9/10/1992,6:50 PM,102555,3.672,True,Product
684,Alice,Female,1/21/2016,5:07 PM,117787,10.485,False,NaN
967,Thomas,Male,3/12/2016,3:10 PM,105681,19.572,False,Engineering
528,Jimmy,NaN,8/26/1983,2:48 AM,86676,7.175,True,Product
609,Todd,Male,2/16/2010,11:29 AM,103405,15.910,False,Sales

In [4]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

## Pick only the columns you need:

In [5]:
emp_cols = pd.read_csv(
  "employees.csv", #You might need the full filepath if the file is located in a different folder.
  usecols=["First Name", "Salary"]
)
emp_cols.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Salary      1000 non-null   int64
dtypes: int64(1), object(1)
memory usage: 15.8+ KB

## Specify 'Yes'/'No' values on import:

In [6]:
""" In this case it does not apply because there are no yes/no columns in my employees.csv.

employees = pd.read_csv(
    "employees.csv", 
    true_values=["Yes", "yes"], 
    false_values=["No", "no"]
)
"""

' In this case it does not apply because there are no yes/no columns in my employees.csv.\n\nemployees = pd.read_csv(\n    "employees.csv", \n    true_values=["Yes", "yes"], \n    false_values=["No", "no"]\n)\n'

## Sample a few rows before doing the whole import:
For larger files you could also look at the read_csv(chunking=###) argument.

In [7]:
numbers = pd.read_csv(
  "employees.csv",
  nrows=10
)
numbers.tail()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
6,Ruby,Female,8/17/1987,4:20 PM,65476,10.012,True,Product
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
9,Frances,Female,8/8/2002,6:51 AM,139852,7.524,True,Business Development

## Changing the 'Start Date' and 'Last Login Time' to date/time objects:

In [8]:
employees['Start Date'] = pd.to_datetime(employees['Start Date'])

In [9]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 62.6+ KB

In [10]:
employees['Last Login Time'] = pd.to_datetime(employees['Last Login Time'], infer_datetime_format=True)

This adds the date to 'Last Login Time' column. Specifying "format='%H%M%S'" causes an error because it doesn't know how to handle the 'AM' and 'PM' parts of the string. I'm unsure how to handle this and more research is needed(???).

In [11]:
employees['Last Login Time'] = pd.to_datetime(employees['Last Login Time'], format='%H%M%S')
#This doesn't seem to change the format, unsure why.

In [12]:
employees.sample(7)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
543,Anna,Female,2008-04-15,2022-11-20 14:34:00,117293,2.366,False,Client Services
356,Judy,Female,1990-02-01,2022-11-20 15:32:00,38092,5.668,False,Distribution
447,Gregory,Male,2009-05-15,2022-11-20 15:52:00,142208,11.204,True,Engineering
163,Terry,Male,1990-09-03,2022-11-20 21:15:00,52226,19.135,False,Client Services
903,Heather,Female,1983-07-29,2022-11-20 10:48:00,47605,14.955,True,Human Resources
888,Marilyn,Female,2007-10-08,2022-11-20 00:32:00,115149,11.934,True,Legal
792,Anne,NaN,1996-04-18,2022-11-20 23:57:00,122762,9.564,False,Distribution

In [13]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: datetime64[ns](2), float64(1), int64(1), object(4)
memory usage: 62.6+ KB

## Set the index column on import:

In [14]:
""" I only have employees.csv, not numbers.csv
numbers = pd.read_csv(
  "filepath_to_numbers.csv",
  nrows=1000,
  index_col="Numbers"
)
"""

' I only have employees.csv, not numbers.csv\nnumbers = pd.read_csv(\n  "filepath_to_numbers.csv",\n  nrows=1000,\n  index_col="Numbers"\n)\n'

## Handle missing values:
https://towardsdatascience.com/working-with-missing-values-in-pandas-5da45d16e74

*Be aware that setting NA,NaN,null values to 0 might affect the statistics of the data.

In [15]:
employees_na_handling = pd.read_csv(
    "employees.csv",
    na_values=["0"]
)

You could also use the Missingno library to visualize missing data:
https://towardsdatascience.com/visualizing-missing-values-in-python-is-shockingly-easy-56ed5bc2e7ea

Functions to deal with missing values:
- isnull()
- notnull()
- dropna()
- fillna()
- replace() #if df already created.
- interpolate()
- in pd.read_csv("blah.csv", na_values(['?','&'])

# Encoding:
This is how the human readable part (string) is mapped/translated to machine readable part (binary). Currently the norm is UTF-8.

python package: chardet (pip install chardet)(https://pypi.org/project/chardet/). 'chardet' is a python package to help identify encodings. It also has a command line tool to help detect what type of encoding a file has. This could be useful for loading a file into Pandas.

If you have an encoding error you will recieve something like this:

UnicodeDecodeError: 'utf-8' codec can't decode byte 0x99 in position 7955: invalid start byte

UnicodeDecodeError: 'ascii' codec can't decode byte 0xe2 in position 25: ordinal not in range(128)

Python methods to help translate between encodings:

- .encode() https://www.geeksforgeeks.org/python-strings-encode-method/?ref=lbp
- .decode() https://www.geeksforgeeks.org/python-strings-decode-method/

In [16]:
# This will create a new file in the same folder as your notebook. (will be saved as UTF-8 by default)
employees.to_csv("employees-utf8.csv")

Another option I came across was opening the file in VS Code and saving it. It should be saved as UTF-8 by default but pandas still hand trouble with some of the symbols that were saved.